hg.Appearance = hg.Appearance or {}
local RandomNames = {
    [1] = { -- Мужские имена
        "Александр",
        "Дмитрий",
        "Михаил",
        "Сергей",
        "Владимир",
        "Борис",
        "Иван",
        "Николай",
        "Пётр",
        "Андрей",
        "Алексей",
        "Виктор",
        "Евгений",
        "Олег",
        "Юрий",
        "Григорий",
        "Аркадий"
    },
    [2] = { -- Женские имена
        "Екатерина",
        "Ольга",
        "Татьяна",
        "Наталья",
        "Светлана",
        "Анна",
        "Мария",
        "Ирина",
        "Елена",
        "Людмила",
        "Галина",
        "Вера",
        "Надежда",
        "Любовь",
        "Анастасия",
        "Дарья",
        "Ксения"
    }
}
hg.Appearance.RandomNames = RandomNames